Revit 2027 API
RadioButtonGroupData Constructor
Constructs a new instance of RadioButtonGroupData.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RadioButtonGroupData(
	string name
)
Public Sub New (
	name As String
)
public:
RadioButtonGroupData(
	String^ name
)
new :
        name : string -> RadioButtonGroupData
Parameters
name String
The internal name of the RadioButtonGroup.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is passed for name.
ArgumentException | Thrown when an empty string is passed for name.
See Also
Reference
RadioButtonGroupData Class
Autodesk.Revit.UI Namespace